<template>
<div class="rules-block">

  <div class="rules-block__title">Правила прохождения теста на знание неправильных глаголов</div>
  <div class="rules-block__text">
    <p>1) На стартовом экране Вам предлагается выбрать уровень сложности. Чем выше уровень, тем меньше времени отпускается для ответа на вопрос, больше вопросов и больше групп глаголов, участвующих в выборке. Все глаголы разделены на 4 условные группы, сформированные в зависимоти от частоты употребления: 1 группа - самые употребляемые и важные глаголы, а 4, соответственно - редко употребляемые. Каждый раз при запуске или рестарте теста, глаголы случайным образом формируют массив для теста в соответствии с выбранной сложностью. После выбора уровня сложности нажать кнопку 'ПРОЙТИ ТЕСТ'.
    </p>
    <p>2) После начала теста Вы увидите на экране блок формы для заполнения со следующими вспомогательными информационными элементами: в левом верхнем углу - счетчик вопросов; справа в верхнем углу - таймер с остатком времени для ответа; сверху в центре - русское значение глагола. Ниже расположен блок с тремя полями для ввода ответов, каждое поле соответствует форме глагола.</p>
    <p>После заполнения полей кнопка 'Ответить' станет активной.</p>
    <p>По истечению времени таймера, независимо от заполнения полей, ответ будет отмечен, как пройденный. Если поле осталось пустым - ответ считается ошибочным.</p>
    <p>В нижней части, в зависимости от ответа, появится соответствующее сообщение</p>
    <p><b>Важно!</b> У глагола be - поле past simple заполняется двумя значениями через символ '/' без пробелов (was/were)</p>


  </div>

</div>
</template>

<script>
import global from './../global.js'

export default {
  name: 'PopUp',
  props: {
    target: String,

  },
  data: function () {
    return {

    }
  },
  components: {
    // SomeComp,
  },
  methods: {
    toChangeShowIvRulesPopup() {
      console.log(this.target);
      this.$store.commit('changeShowPopup', {
        target: this.target,
        show: false
      });
    }

  },
  computed: {

  },
}
</script>

<style lang="scss">
@import '../scss/_variables.scss';

@import '../scss/_functions.scss';

.rules-block {
  display: block;
  height: auto;
  overflow: hidden;
  padding: 0 vh(20);

  &__title {
    font-size: vh(20);
    font-weight: 600;
    margin: 0 auto vh(20);
    line-height: 1.1;
  }

  &__text {
    font-size: vh(16);
    line-height: 1.5;
    margin: 0 0 vh(12);
  }
}
</style>
